In [1]:
import sqlite3
import pandas as pd

In [2]:
pd.options.display.max_columns = None
#pd.options.display.max_rows = None

In [3]:
conn = sqlite3.connect('parch-and-posey.db')

In [4]:
cursor = conn.cursor()
cursor.execute('''
select * from sqlite_master where type = "table";
''')
columns = [col[0] for col in cursor.description]
data = cursor.fetchall()
cursor.close()

In [5]:
pd.DataFrame(data, columns=columns)

,type,name,tbl_name,rootpage,sql
0,table,web_events,web_events,2,"CREATE TABLE web_events (\tid integer,\taccoun..."
1,table,sales_reps,sales_reps,92,"CREATE TABLE sales_reps (\tid integer,\tname b..."
2,table,region,region,93,"CREATE TABLE region (\tid integer,\tname bpchar)"
3,table,orders,orders,94,"CREATE TABLE orders (\tid integer,\taccount_id..."
4,table,accounts,accounts,221,"CREATE TABLE accounts (\tid integer,\tname bpc..."

# Percentiles with Partitions

You can use partitions with percentiles to determine the percentile of a specific subset of all rows. Imagine you're an analyst at Parch & Posey and you want to determine the largest orders (in terms of quantity) a specific customer has made to encourage them to order more similarly sized large orders. You only want to consider the NTILE for that customer's account_id.

Task 1:

Use the NTILE functionality to divide the accounts into 4 levels in terms of the amount of standard_qty for their orders. Your resulting table should have the account_id, the occurred_at time for each order, the total amount of standard_qty paper purchased, and one of four levels in a standard_quartile column.

In [14]:
pd.read_sql_query(sql='''
SELECT account_id,
       occurred_at,
       standard_qty,
       NTILE(4) OVER(PARTITION BY account_id ORDER BY standard_qty) quartile_standard_qty
FROM orders;
''', con=conn)[:50]

    account_id          occurred_at  standard_qty  quartile_standard_qty
0         1001  2015-12-04 04:21:55            85                      1
1         1001  2016-05-31 21:22:48            91                      1
2         1001  2016-06-30 12:32:05            94                      1
3         1001  2016-05-01 15:55:51            95                      1
4         1001  2016-10-26 20:31:30            97                      1
5         1001  2016-04-01 11:20:18           101                      1
6         1001  2016-07-30 03:26:30           101                      1
7         1001  2016-03-02 15:29:32           103                      2
8         1001  2016-09-26 23:28:25           104                      2
9         1001  2016-02-01 19:27:27           108                      2
10        1001  2015-10-06 17:31:14           123                      2
11        1001  2016-12-24 05:53:13           123                      2
12        1001  2016-08-28 07:13:39           124                      2
13        1001  2016-11-25 23:21:32           127                      2
14        1001  2016-01-02 01:18:24           144                      3
15        1001  2015-11-05 03:34:33           190                      3
16        1001  2016-07-30 03:21:57           457                      3
17        1001  2016-02-01 19:07:32           473                      3
18        1001  2016-05-01 15:40:04           483                      3
19        1001  2016-11-25 23:19:37           485                      3
20        1001  2016-04-01 11:15:27           497                      3
21        1001  2016-03-02 15:40:29           498                      4
22        1001  2015-11-05 03:25:21           506                      4
23        1001  2016-09-26 23:22:47           507                      4
24        1001  2015-12-04 04:01:09           526                      4
25        1001  2016-05-31 21:09:48           531                      4
26        1001  2016-08-28 06:50:58           557                      4
27        1001  2016-01-02 00:59:09           566                      4
28        1011  2016-12-21 10:59:34           527                      1
29        1021  2015-10-12 02:31:30             0                      1
30        1021  2015-11-11 07:24:19             0                      1
31        1021  2016-01-10 09:12:52             0                      1
32        1021  2016-02-09 00:57:54            64                      2
33        1021  2015-12-11 16:53:18           483                      2
34        1021  2015-11-11 07:37:01           497                      2
35        1021  2016-02-09 00:50:46           502                      3
36        1021  2015-10-12 02:21:56           516                      3
37        1021  2016-01-10 09:29:45           535                      4
38        1021  2016-03-10 00:38:52           555                      4
39        1031  2016-12-25 03:54:27          1148                      1
40        1041  2016-11-13 09:45:21            10                      1
41        1041  2016-10-14 23:48:46            64                      1
42        1041  2016-12-12 07:50:01           157                      2
43        1041  2016-10-14 23:54:21           298                      3
44        1041  2016-11-13 10:11:52           307                      4
45        1051  2016-10-31 07:04:25             6                      1
46        1051  2016-11-30 07:32:58            23                      1
47        1051  2016-10-01 00:48:28           486                      1
48        1051  2016-11-30 07:31:16           490                      2
49        1051  2016-12-30 08:45:43           495                      2

Solution:

SELECT
       account_id,
       occurred_at,
       standard_qty,
       NTILE(4) OVER (PARTITION BY account_id ORDER BY standard_qty) AS standard_quartile
  FROM orders 
 ORDER BY account_id DESC

Task 2:

Use the NTILE functionality to divide the accounts into two levels in terms of the amount of gloss_qty for their orders. Your resulting table should have the account_id, the occurred_at time for each order, the total amount of gloss_qty paper purchased, and one of two levels in a gloss_half column.

In [20]:
pd.read_sql_query(sql='''
SELECT account_id,
       occurred_at,
       gloss_qty,
       NTILE(2) OVER(PARTITION BY account_id ORDER BY gloss_qty) half_gloss_qty
FROM orders;
''', con=conn)[:50]

    account_id          occurred_at  gloss_qty  half_gloss_qty
0         1001  2016-09-26 23:28:25         10               1
1         1001  2016-05-31 21:22:48         16               1
2         1001  2015-10-06 17:31:14         22               1
3         1001  2016-03-02 15:29:32         24               1
4         1001  2016-02-01 19:27:27         29               1
5         1001  2016-01-02 01:18:24         32               1
6         1001  2016-04-01 11:20:18         33               1
7         1001  2016-08-28 07:13:39         33               1
8         1001  2016-07-30 03:26:30         36               1
9         1001  2016-11-25 23:21:32         39               1
10        1001  2015-11-05 03:34:33         41               1
11        1001  2016-06-30 12:32:05         46               1
12        1001  2015-12-04 04:21:55         47               1
13        1001  2016-05-01 15:55:51         47               1
14        1001  2016-12-24 05:53:13        127               2
15        1001  2016-10-26 20:31:30        143               2
16        1001  2016-07-30 03:21:57        532               2
17        1001  2016-11-25 23:19:37        543               2
18        1001  2016-05-01 15:40:04        570               2
19        1001  2016-08-28 06:50:58        572               2
20        1001  2016-02-01 19:07:32        595               2
21        1001  2015-12-04 04:01:09        597               2
22        1001  2016-05-31 21:09:48        603               2
23        1001  2016-03-02 15:40:29        605               2
24        1001  2015-11-05 03:25:21        612               2
25        1001  2016-09-26 23:22:47        614               2
26        1001  2016-04-01 11:15:27        618               2
27        1001  2016-01-02 00:59:09        645               2
28        1011  2016-12-21 10:59:34         14               1
29        1021  2015-12-11 16:53:18          0               1
30        1021  2016-01-10 09:29:45          0               1
31        1021  2016-02-09 00:50:46          4               1
32        1021  2016-03-10 00:38:52         19               1
33        1021  2015-10-12 02:21:56         23               1
34        1021  2016-01-10 09:12:52         32               2
35        1021  2015-11-11 07:24:19         36               2
36        1021  2016-02-09 00:57:54         38               2
37        1021  2015-11-11 07:37:01         61               2
38        1021  2015-10-12 02:31:30        270               2
39        1031  2016-12-25 03:54:27          0               1
40        1041  2016-11-13 10:11:52         22               1
41        1041  2016-10-14 23:54:21         28               1
42        1041  2016-12-12 07:50:01         34               1
43        1041  2016-10-14 23:48:46        196               2
44        1041  2016-11-13 09:45:21        490               2
45        1051  2016-10-01 00:48:28          0               1
46        1051  2016-12-30 08:48:45          0               1
47        1051  2016-12-30 08:45:43          1               1
48        1051  2016-11-30 07:31:16         18               1
49        1051  2016-09-01 05:38:19         35               1

Solution:

SELECT
       account_id,
       occurred_at,
       gloss_qty,
       NTILE(2) OVER (PARTITION BY account_id ORDER BY gloss_qty) AS gloss_half
  FROM orders 
 ORDER BY account_id DESC

Task 3:

Use the NTILE functionality to divide the orders for each account into 100 levels in terms of the amount of total_amt_usd for their orders. Your resulting table should have the account_id, the occurred_at time for each order, the total amount of total_amt_usd paper purchased, and one of 100 levels in a total_percentile column.

In [22]:
pd.read_sql_query(sql='''
SELECT account_id,
       occurred_at,
       total_amt_usd,
       NTILE(100) OVER(PARTITION BY account_id ORDER BY total_amt_usd) percentile_total_amt_usd
FROM orders
ORDER BY account_id DESC;
''', con=conn)[:50]

    account_id          occurred_at  total_amt_usd  percentile_total_amt_usd
0         4501  2016-11-22 06:57:04          86.78                         1
1         4501  2016-05-30 04:18:34         157.24                         2
2         4501  2016-12-21 13:43:26         628.74                         3
3         4501  2016-06-29 03:57:11         875.54                         4
4         4501  2016-07-29 20:06:39         974.17                         5
5         4501  2016-10-24 08:50:37        1122.55                         6
6         4501  2016-08-27 00:48:17        1175.47                         7
7         4501  2016-09-25 01:44:03        1324.34                         8
8         4501  2016-08-27 00:58:11        1449.74                         9
9         4501  2016-11-22 06:52:22        1473.92                        10
10        4501  2016-07-29 19:58:32        1486.06                        11
11        4501  2016-12-21 13:30:42        1850.13                        12
12        4501  2016-06-29 04:03:39        2024.48                        13
13        4491  2014-06-03 17:33:33        1591.81                         1
14        4491  2014-07-31 05:06:42        1619.36                         2
15        4491  2014-12-26 21:55:31        1631.85                         3
16        4491  2014-10-27 19:05:26        1690.05                         4
17        4491  2014-03-06 05:19:59        1694.20                         5
18        4491  2015-04-23 15:12:43        1743.02                         6
19        4491  2015-01-24 07:36:29        1746.69                         7
20        4491  2015-03-24 18:50:59        1821.67                         8
21        4491  2014-07-02 00:59:50        1825.50                         9
22        4491  2014-08-29 17:41:40        1904.10                        10
23        4491  2015-02-22 07:19:20        1905.96                        11
24        4491  2014-04-04 19:20:05        1994.61                        12
25        4491  2014-01-06 08:01:26        2112.73                        13
26        4491  2014-11-26 20:13:41        2251.58                        14
27        4491  2014-09-28 15:51:34        2289.56                        15
28        4491  2014-02-04 03:26:34        2479.59                        16
29        4491  2014-05-05 00:04:02        2555.31                        17
30        4491  2014-02-04 03:04:08        5706.59                        18
31        4491  2014-07-31 05:05:06        5999.73                        19
32        4491  2013-12-08 06:34:23        6074.41                        20
33        4491  2014-12-26 21:39:04        6127.12                        21
34        4491  2014-05-05 00:03:19        6267.55                        22
35        4491  2015-02-22 07:24:04        6327.79                        23
36        4491  2014-01-06 08:11:00        6417.04                        24
37        4491  2014-10-27 19:05:05        6422.95                        25
38        4491  2014-08-29 17:15:24        6434.32                        26
39        4491  2015-01-24 07:15:47        7210.59                        27
40        4491  2014-09-28 15:53:06        7684.17                        28
41        4491  2014-03-06 05:22:25        8646.18                        29
42        4481  2016-12-06 03:07:31         844.12                         1
43        4481  2016-10-08 07:38:46         896.20                         2
44        4481  2016-10-08 07:36:28        1349.67                         3
45        4481  2016-11-07 13:03:29        2156.48                         4
46        4481  2016-11-07 12:54:03        4372.34                         5
47        4471  2016-12-05 05:10:54         566.30                         1
48        4471  2016-12-05 04:59:53        2278.16                         2
49        4461  2016-01-07 00:09:55        1669.28                         1

Solution:

SELECT
       account_id,
       occurred_at,
       total_amt_usd,
       NTILE(100) OVER (PARTITION BY account_id ORDER BY total_amt_usd) AS total_percentile
  FROM orders 
 ORDER BY account_id DESC

In [24]:
# Task 1 all accounts

pd.read_sql_query(sql='''
WITH t1 AS (SELECT account_id, SUM(standard_qty) sum_standard_qty
FROM orders
GROUP BY 1
)

SELECT account_id,
       sum_standard_qty,
       NTILE(100) OVER(ORDER BY sum_standard_qty) percentile_sum_standard_qty
FROM t1;
''', con=conn)

     account_id  sum_standard_qty  percentile_sum_standard_qty
0          1901                 0                            1
1          3371                79                            1
2          1961               102                            1
3          3401               116                            1
4          3741               117                            2
..          ...               ...                          ...
345        1281             21943                           99
346        1181             22099                           99
347        3491             22936                          100
348        2631             23321                          100
349        4161             41617                          100

[350 rows x 3 columns]